# Assignment 1 - Python Basic

Assignment details: https://github.com/iabhisekbosepm/Basic-Pyhton/blob/45a75ad8aefc2065a72c778147b2773e583507d0/Assignments-1.pdf

## Assignment 1 - Task 1: Install mongoDb in local

### Install depency libraries
### Dependencies - pymongo

In [1]:
pip install pymongo

Requirement already satisfied: pymongo in ./anaconda3/lib/python3.8/site-packages (3.12.0)
Note: you may need to restart the kernel to use updated packages.

## Starting main python code

Import all the required libraries

In [2]:
import pymongo
from pymongo import MongoClient
import pandas as pd
import numpy as np

## Assignment 1 - Task 2: Create a collection with name of “Sample”, Insert 100 records

There is only one collection "sample" where inserted all countries name code and phone prefix
Example record from that sample collection
{
    "_id": "612b7a44d1977c0c42ce74df"
    "name": "Afghanistan",
    "prefix": "+93",
    "code": "AF"
}

### Connect to local mongoDb database "local"

In [3]:
db = MongoClient("localhost", 27017).local

## Assignment 1 Task 3: Gather those data from mongodb to your jupyter notebook in a dataframe

Fetch data from sample collection

In [4]:
sampleData = db.sample.find().limit(100)

Put sample data in a dataframe

In [5]:
frameData = pd.DataFrame(list(sampleData))
frameData

,_id,name,prefix,code
0,612b7a44d1977c0c42ce74df,Afghanistan,+93,AF
1,612b7a44d1977c0c42ce74e0,Aland Islands,+358,AX
2,612b7a44d1977c0c42ce74e1,Albania,+355,AL
3,612b7a44d1977c0c42ce74e2,Algeria,+213,DZ
4,612b7a44d1977c0c42ce74e3,AmericanSamoa,+1684,AS
...,...,...,...,...
95,612b7a44d1977c0c42ce753e,Hungary,+36,HU
96,612b7a44d1977c0c42ce753f,Iceland,+354,IS
97,612b7a44d1977c0c42ce7540,India,+91,IN
98,612b7a44d1977c0c42ce7541,Indonesia,+62,ID
99,612b7a44d1977c0c42ce7542,"Iran, Islamic Republic of Persian Gulf",+98,IR

## Assignment 1 - Task 4: Convert & save those json data as csv in your machine

In [6]:
filename = "countries.csv"
frameData.to_csv(filename, index=False)

## Assignment 1 - Task 5: Read that csv file via panda

In [7]:
csvData = pd.read_csv(filename);
csvData

,_id,name,prefix,code
0,612b7a44d1977c0c42ce74df,Afghanistan,+93,AF
1,612b7a44d1977c0c42ce74e0,Aland Islands,+358,AX
2,612b7a44d1977c0c42ce74e1,Albania,+355,AL
3,612b7a44d1977c0c42ce74e2,Algeria,+213,DZ
4,612b7a44d1977c0c42ce74e3,AmericanSamoa,+1684,AS
...,...,...,...,...
95,612b7a44d1977c0c42ce753e,Hungary,+36,HU
96,612b7a44d1977c0c42ce753f,Iceland,+354,IS
97,612b7a44d1977c0c42ce7540,India,+91,IN
98,612b7a44d1977c0c42ce7541,Indonesia,+62,ID
99,612b7a44d1977c0c42ce7542,"Iran, Islamic Republic of Persian Gulf",+98,IR

## Assignment 1 - Task 6: Now create another extra column apart from existing data
via python code only, In that column generate 100 random data
via python code

In [8]:
csvData['random'] = np.random.randint(100, 500, size=len(csvData))
csvData

,_id,name,prefix,code,random
0,612b7a44d1977c0c42ce74df,Afghanistan,+93,AF,216
1,612b7a44d1977c0c42ce74e0,Aland Islands,+358,AX,229
2,612b7a44d1977c0c42ce74e1,Albania,+355,AL,164
3,612b7a44d1977c0c42ce74e2,Algeria,+213,DZ,244
4,612b7a44d1977c0c42ce74e3,AmericanSamoa,+1684,AS,257
...,...,...,...,...,...
95,612b7a44d1977c0c42ce753e,Hungary,+36,HU,109
96,612b7a44d1977c0c42ce753f,Iceland,+354,IS,279
97,612b7a44d1977c0c42ce7540,India,+91,IN,232
98,612b7a44d1977c0c42ce7541,Indonesia,+62,ID,393
99,612b7a44d1977c0c42ce7542,"Iran, Islamic Republic of Persian Gulf",+98,IR,346

## Assignment 1 - Task 7: Now print top 5 rows

In [9]:
csvData.head(5)

                        _id           name prefix code  random
0  612b7a44d1977c0c42ce74df    Afghanistan    +93   AF     216
1  612b7a44d1977c0c42ce74e0  Aland Islands   +358   AX     229
2  612b7a44d1977c0c42ce74e1        Albania   +355   AL     164
3  612b7a44d1977c0c42ce74e2        Algeria   +213   DZ     244
4  612b7a44d1977c0c42ce74e3  AmericanSamoa  +1684   AS     257

## Assignment 1 - Task 8:  Now print what dimensional matrix this dataframe

Get the shape

In [10]:
shape = csvData.shape
shape

(100, 5)

Get the dimnation from shape

In [11]:
dimentions = len(shape)
dimentions

2

## Assignment 1 - Task 9: Transpose this dataframe

In [12]:
transposeCsvData = csvData.T
transposeCsvData

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
_id,612b7a44d1977c0c42ce74df,612b7a44d1977c0c42ce74e0,612b7a44d1977c0c42ce74e1,612b7a44d1977c0c42ce74e2,612b7a44d1977c0c42ce74e3,612b7a44d1977c0c42ce74e4,612b7a44d1977c0c42ce74e5,612b7a44d1977c0c42ce74e6,612b7a44d1977c0c42ce74e7,612b7a44d1977c0c42ce74e8,...,612b7a44d1977c0c42ce7539,612b7a44d1977c0c42ce753a,612b7a44d1977c0c42ce753b,612b7a44d1977c0c42ce753c,612b7a44d1977c0c42ce753d,612b7a44d1977c0c42ce753e,612b7a44d1977c0c42ce753f,612b7a44d1977c0c42ce7540,612b7a44d1977c0c42ce7541,612b7a44d1977c0c42ce7542
name,Afghanistan,Aland Islands,Albania,Algeria,AmericanSamoa,Andorra,Angola,Anguilla,Antarctica,Antigua and Barbuda,...,Guyana,Haiti,Holy See (Vatican City State),Honduras,Hong Kong,Hungary,Iceland,India,Indonesia,"Iran, Islamic Republic of Persian Gulf"
prefix,+93,+358,+355,+213,+1684,+376,+244,+1264,+672,+1268,...,+595,+509,+379,+504,+852,+36,+354,+91,+62,+98
code,AF,AX,AL,DZ,AS,AD,AO,AI,AQ,AG,...,GY,HT,VA,HN,HK,HU,IS,IN,ID,IR
random,216,229,164,244,257,134,199,398,478,259,...,220,435,355,202,260,109,279,232,393,346

## Assignment 1 - Task 10: Now print what dimension matrix this dataframe

In [13]:
newShape = transposeCsvData.shape
newShape

(5, 100)

In [14]:
newDimentions = len(newShape)
newDimentions

2

## Assignment 1 - Task 11: Write properly pointwise in that jupyter notebook only, what’re those things you learned from this assignments

1. Basic of jupiter notebook
2. Python package installation 
3. Python basic
4. MongoDb use in python
5. Panda dataframe
6. Panda csv read and write
7. Random number generate by numpy
8. Partial reading of a csv file
9. Transposing a data set or frame